
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/terraform-team10/actions/runs/5015527486)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 2 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-07a4c28652eeaee29]
data.aws_ami.amazon-linux-2: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01ad894d46bd3cad3]
aws_iam_role.my_role: Refreshing state... [id=MyRole]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-06f2af779336fb35a]
aws_iam_role_policy_attachment.my_policy_attachment: Refreshing state... [id=MyRole-20230518151637683900000001]
aws_iam_instance_profile.my_profile: Refreshing state... [id=MyProfile]
data.aws_ami.amazon-linux-2: Read complete after 1s [id=ami-0828596b82405edd7]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07fb9f6b52cdbf8be]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0eead1eb49677fff1]
aws_security_group.alb: Refreshing state... [id=sg-0af7896bb044eb7e0]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-09bd0c935460fc9fe]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0f290a9651e263ab5]
aws_security_group.ecs: Refreshing state... [id=sg-041bcb6d7a94c6c7b]
aws_security_group.bastion: Refreshing state... [id=sg-0dad0456213a082a7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06eac2c0b2a468a6e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01c6cbe9a99f690a3]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-008aaccaa805fbb61]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a0c14da02e24f0c3]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07f32afd5a236a5c1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f79bf345d85e387e]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07f264423ca8c4ba5]
aws_security_group.mysql_sg: Refreshing state... [id=sg-075302cd488f6a83b]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3075222001]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-008aaccaa805fbb611080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-019473ec8cb149b34]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-09f95ae288a50c6fc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bc3263f6f05ece6c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-02747a2698ed5030b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d96ed8ffec333ffc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02c6aff70a47b641a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f79bf345d85e387e1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07f264423ca8c4ba51080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.bastion_server will be created
  + resource "aws_instance" "bastion_server" {
      + ami                                  = "ami-0828596b82405edd7"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "MyProfile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-01c6cbe9a99f690a3"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.bastion must be replaced
-/+ resource "aws_security_group" "bastion" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:761817748648:security-group/sg-0dad0456213a082a7" -> (known after apply)
      ~ id                     = "sg-0dad0456213a082a7" -> (known after apply)
        name                   = "bastion"
      + name_prefix            = (known after apply)
      ~ owner_id               = "761817748648" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-02256026e810bf80f" -> "vpc-01ad894d46bd3cad3" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.mysql_sg must be replaced
-/+ resource "aws_security_group" "mysql_sg" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:761817748648:security-group/sg-075302cd488f6a83b" -> (known after apply)
      ~ id                     = "sg-075302cd488f6a83b" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0dad0456213a082a7",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "mysql_sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "761817748648" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-02256026e810bf80f" -> "vpc-01ad894d46bd3cad3" # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
aws_security_group.mysql_sg: Destroying... [id=sg-075302cd488f6a83b]
aws_security_group.mysql_sg: Destruction complete after 2s
aws_security_group.bastion: Destroying... [id=sg-0dad0456213a082a7]
aws_security_group.bastion: Destruction complete after 2s
aws_security_group.bastion: Creating...
aws_security_group.bastion: Creation complete after 5s [id=sg-004c2e47d523752ba]
aws_security_group.mysql_sg: Creating...
aws_instance.bastion_server: Creating...
aws_security_group.mysql_sg: Creation complete after 3s [id=sg-00425b9aaecbe5064]
aws_instance.bastion_server: Still creating... [10s elapsed]
aws_instance.bastion_server: Still creating... [20s elapsed]
aws_instance.bastion_server: Still creating... [30s elapsed]
aws_instance.bastion_server: Creation complete after 34s [id=i-0ede47abcf13c1bcb]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 2 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"618abe00d5b9d8d5229929c156b4374e5bf9d86b","Vars":{},"WorkflowName":"Terraform"} -->